In [4]:

    import pandas as pd
data_dict = {'name': ['Nancy','Andrew','Janet','Margaret','Steven'],
             'monthly_salary':[5000,4000,6000,3000,2000],
             'zip':[98122,98401,98033,98052,98051]}
emp_df = pd.DataFrame(data_dict)
print(emp_df)
print('\n', type(emp_df))

       name  monthly_salary    zip
0     Nancy            5000  98122
1    Andrew            4000  98401
2     Janet            6000  98033
3  Margaret            3000  98052
4    Steven            2000  98051

 <class 'pandas.core.frame.DataFrame'>

In [5]:
emp_df.iloc[0]

name              Nancy
monthly_salary     5000
zip               98122
Name: 0, dtype: object

In [6]:
emp_df.iloc[4]

name              Steven
monthly_salary      2000
zip                98051
Name: 4, dtype: object

In [7]:
print('Shape of dataframe emp_df is:', emp_df.shape)   
print('Size of dataframe emp_df is:', emp_df.size)

Shape of dataframe emp_df is: (5, 3)
Size of dataframe emp_df is: 15

In [8]:
print('Average salary for employees is: $',emp_df['monthly_salary'].mean())

Average salary for employees is: $ 4000.0

In [9]:
emp_df.sort_values('name')

       name  monthly_salary    zip
1    Andrew            4000  98401
2     Janet            6000  98033
3  Margaret            3000  98052
0     Nancy            5000  98122
4    Steven            2000  98051

In [10]:
temp=emp_df[emp_df['zip'] == 98033]
temp

    name  monthly_salary    zip
2  Janet            6000  98033

In [11]:
emp_df["annual_salary"]=emp_df["monthly_salary"]*12
emp_df["annual_salary"].head()
emp_df

       name  monthly_salary    zip  annual_salary
0     Nancy            5000  98122          60000
1    Andrew            4000  98401          48000
2     Janet            6000  98033          72000
3  Margaret            3000  98052          36000
4    Steven            2000  98051          24000

In [12]:
emp_df.rename(columns={'name':'firstname'}, inplace=True)
list(emp_df.columns.values)

['firstname', 'monthly_salary', 'zip', 'annual_salary']

In [13]:
emp_df

  firstname  monthly_salary    zip  annual_salary
0     Nancy            5000  98122          60000
1    Andrew            4000  98401          48000
2     Janet            6000  98033          72000
3  Margaret            3000  98052          36000
4    Steven            2000  98051          24000

In [14]:
emp_info=emp_df[['firstname','annual_salary','zip']]
emp_info

  firstname  annual_salary    zip
0     Nancy          60000  98122
1    Andrew          48000  98401
2     Janet          72000  98033
3  Margaret          36000  98052
4    Steven          24000  98051

In [15]:
emp_info['firstname']

0       Nancy
1      Andrew
2       Janet
3    Margaret
4      Steven
Name: firstname, dtype: object

In [16]:
emp_info.drop(columns='annual_salary')

  firstname    zip
0     Nancy  98122
1    Andrew  98401
2     Janet  98033
3  Margaret  98052
4    Steven  98051